#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/deploymenttheory/terraform-jamfpro-demo/runs/run-8WfbF8D5WZBmZdi5

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
jamfpro_category.jamfpro_category_001: Refreshing state... [id=117]
jamfpro_package.jamfpro_package_002: Refreshing state... [id=109]
jamfpro_macos_configuration_profile.jamfpro_macos_configuration_profile_001: Refreshing state... [id=1764]
data.jamfpro_category.jamfpro_category_001_data: Refreshing...
data.jamfpro_package.jamfpro_package_002_data: Refreshing...
data.jamfpro_category.jamfpro_category_001_data: Refresh complete after 0s [id=117]
data.jamfpro_package.jamfpro_package_002_data: Refresh complete after 0s [id=109]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "JAMFPRO_INSTANCE_NAME"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-8WfbF8D5WZBmZdi5/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "JAMFPRO_CLIENT_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-8WfbF8D5WZBmZdi5/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.jamfpro_script.jamfpro_script_001_data will be read during apply
  # (config refers to values not yet known)
 <= data "jamfpro_script" "jamfpro_script_001_data" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # jamfpro_script.jamfpro_script_001 will be created
  + resource "jamfpro_script" "jamfpro_script_001" {
      + category_id     = (known after apply)
      + category_name   = (known after apply)
      + id              = (known after apply)
      + info            = "Adds target user or group to specified group membership, or removes said membership."
      + name            = "tf-ghatest-correct-application-permissions-v1.0"
      + notes           = "Jamf Pro script parameters: 4 -> 7"
      + os_requirements = "13"
      + parameter4      = "Google Chrome"
      + priority        = "BEFORE"
      + script_contents = <<-EOT
            #!/bin/sh
            
            ###
            #
            #            Name:  Correct Application Permissions.sh
            #     Description:  Changes ownership of the target application to the current
            #                   logged-in user.
            #                   NOTE: This script is managed by AutoPkg and should be
            #                   updated in the jamf-pro-scripts repository rather than the
            #                   Jamf Pro console.
            #         Created:  2021-03-04
            #   Last Modified:  2021-03-04
            #         Version:  1.0
            #
            # Copyright 2021 Palantir Technologies, Inc.
            #
            # Licensed under the Apache License, Version 2.0 (the "License");
            # you may not use this file except in compliance with the License.
            # You may obtain a copy of the License at
            #
            # http://www.apache.org/licenses/LICENSE-2.0
            #
            # Unless required by applicable law or agreed to in writing, software
            # distributed under the License is distributed on an "AS IS" BASIS,
            # WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
            # See the License for the specific language governing permissions and
            # limitations under the License.
            #
            ###
            
            # Hi everyone
            
            ########## variable-ing ##########
            
            
            # Jamf Pro script parameter: "Target Application"
            # The application to target for permissions repair.
            # Use the application file name without extension (e.g. "Google Chrome").
            targetApp="${4}"
            # Get current user and OS information.
            loggedInUser=$(/usr/bin/stat -f%Su "/dev/console")
            
            
            
            ########## function-ing ##########
            
            
            
            # Exits if any required Jamf Pro arguments are undefined.
            check_jamf_pro_arguments () {
              if [ -z "$targetApp" ]; then
                echo "❌ ERROR: Undefined Jamf Pro argument, unable to proceed."
                exit 74
              fi
            }
            
            
            # Exits if root is the currently logged-in user, or no logged-in user is detected.
            check_logged_in_user () {
              if [ "$loggedInUser" = "root" ] || [ -z "$loggedInUser" ]; then
                echo "Nobody is logged in, no action required."
                exit 0
              fi
            }
            
            
            
            ########## main process ##########
            
            
            
            # Check script prerequisites.
            check_jamf_pro_arguments
            check_logged_in_user
            
            
            # Change ownership on the target application to the current logged-in user.
            if [ -d "/Applications/${targetApp}.app" ]; then
              echo "Correcting permissions for ${targetApp}..."
              chown -R "$(stat -f%Su /dev/console)" "/Applications/${targetApp}.app"
            else
              echo "❌ ERROR: ${targetApp} missing, unable to proceed."
              exit 1
            fi
            
            
            
            exit 0
        EOT
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + jamfpro_script_001_data_id     = (known after apply)
  + jamfpro_script_001_data_name   = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @ShocOne, Action: `pull_request`, Working Directory: `workload/terraform/jamfpro`, Workflow: `Terraform Plan`*